#+STARTUP: content
** change default key bind
   #+BEGIN_SRC emacs-lisp
     (define-key global-map (kbd "C-t") 'other-window)
     (global-set-key (kbd "\M-y") 'yank-pop)
     (global-set-key "\C-h" 'backward-delete-char-untabify)
     (global-set-key "\M-h" 'backward-kill-word)
     (global-set-key "\C-xh" 'help-command)
     (global-set-key "\C-xa" 'mark-whole-buffer)
     (global-set-key (kbd "C-.") 'repeat)
     (global-set-key (kbd "\r") 'newline-and-indent) ;; new line to be indented
     (define-key global-map "\M-h" nil)
     (global-set-key (kbd "C-M-SPC") 'mark-paragraph);;mark paragraph
     (global-set-key "\M-n" (lambda () (interactive) (scroll-up 1)))
     (global-set-key "\M-p" (lambda () (interactive) (scroll-down 1)))
     (global-set-key (kbd "C-S-n") (lambda () (interactive) (forward-line 5)))
     (global-set-key (kbd "C-S-p") (lambda () (interactive) (previous-line 5)))
   #+END_SRC

   #+RESULTS:
   | lambda | nil | (interactive) | (previous-line 5) |

